espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/bouffalolab/repo/components/platform/soc/bl702/bl702_usb_cdc/Src/bl702_hal_pcd.c
//#include "usb_mem.h"
#include "bl702_hal_pcd.h"
#include "bl702_usb.h"
#include "bl_irq.h"
#define USBD_DbgLog(...)

#if USE_USB_EP0_IN_BUFF
uint8_t ep0_in_data_buff[EP0_BUFF_LEN_MAX] = {0};
#endif
#if USE_USB_EP1_IN_BUFF
uint8_t ep1_in_data_buff[EP1_BUFF_LEN_MAX] = {0};
#endif
#if USE_USB_EP2_IN_BUFF
uint8_t ep2_in_data_buff[EP2_BUFF_LEN_MAX] = {0};
#endif
#if USE_USB_EP3_IN_BUFF
uint8_t ep3_in_data_buff[EP3_BUFF_LEN_MAX] = {0};
#endif
#if USE_USB_EP4_IN_BUFF
uint8_t ep4_in_data_buff[EP4_BUFF_LEN_MAX] = {0};
#endif
#if USE_USB_EP5_IN_BUFF
uint8_t ep5_in_data_buff[EP5_BUFF_LEN_MAX] = {0};
#endif
#if USE_USB_EP6_IN_BUFF
uint8_t ep6_in_data_buff[EP6_BUFF_LEN_MAX] = {0};
#endif
#if USE_USB_EP7_IN_BUFF
uint8_t ep7_in_data_buff[EP7_BUFF_LEN_MAX] = {0};
#endif
#if USE_USB_EP0_OUT_BUFF
uint8_t ep0_out_data_buff[EP0_BUFF_LEN_MAX] = {0};
#endif
#if USE_USB_EP1_OUT_BUFF
uint8_t ep1_out_data_buff[EP1_BUFF_LEN_MAX] = {0};
#endif
#if USE_USB_EP2_OUT_BUFF
uint8_t ep2_out_data_buff[EP2_BUFF_LEN_MAX] = {0};
#endif
#if USE_USB_EP3_OUT_BUFF
uint8_t ep3_out_data_buff[EP3_BUFF_LEN_MAX] = {0};
#endif
#if USE_USB_EP4_OUT_BUFF
uint8_t ep4_out_data_buff[EP4_BUFF_LEN_MAX] = {0};
#endif
#if USE_USB_EP5_OUT_BUFF
uint8_t ep5_out_data_buff[EP5_BUFF_LEN_MAX] = {0};
#endif
#if USE_USB_EP6_OUT_BUFF
uint8_t ep6_out_data_buff[EP6_BUFF_LEN_MAX] = {0};
#endif
#if USE_USB_EP7_OUT_BUFF
uint8_t ep7_out_data_buff[EP7_BUFF_LEN_MAX] = {0};
#endif


#define STRESS_DATA_LENGTH        (4*1024)
uint8_t USB_Stress_Test_Origin_Data[STRESS_DATA_LENGTH] = {0};
uint8_t USB_Stress_Test_Recv_Data[STRESS_DATA_LENGTH] = {0};
uint32_t StressTestItem = 0;
void USB_Stress_Test_Origin_Init(void)
{
    uint8_t packValue = 0;

    StressTestItem = 0;
    //USBD_DbgLog("USB_Stress_Test_Origin_Init\r\n");
    for(uint32_t i=0;i<STRESS_DATA_LENGTH;i++){
        USB_Stress_Test_Origin_Data[i] = 0x30 + packValue;
        USB_Stress_Test_Recv_Data[i] = 0;
        //USBD_DbgLog("%c",USB_Stress_Test_Origin_Data[i]);
        if((i%64==0)&&(i!=0)){
            packValue++;
        }
        if(packValue>9){
            packValue=0;
        }
    }

}

uint8_t USB_Stress_Test_Data_Check(void)
{
    for(uint32_t i=0;i<STRESS_DATA_LENGTH;i++){
        if(USB_Stress_Test_Origin_Data[i] != USB_Stress_Test_Recv_Data[i]){
            return 1;
        }
    }

    return 0;
}


#ifdef BFLB_USE_HAL_DRIVER
void USB_IRQHandler(void)
{
    extern PCD_HandleTypeDef hpcd_USB_FS;
    extern void HAL_PCD_IRQHandler(PCD_HandleTypeDef *hpcd);
    HAL_PCD_IRQHandler(&hpcd_USB_FS);
}
#endif


/**
  * @brief  Initializes the PCD according to the specified
  *         parameters in the PCD_InitTypeDef and create the associated handle.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_Init(PCD_HandleTypeDef *hpcd)
{ 
    uint32_t i = 0U;

    /* Check the PCD handle allocation */
    if(hpcd == NULL)
    {
        return HAL_ERROR;
    }

    if(hpcd->State == HAL_PCD_STATE_RESET)
    {  
        /* Allocate lock resource and initialize it */
        hpcd->Lock = HAL_UNLOCKED;

        /* Init the low level hardware : GPIO, CLOCK, NVIC... */
        USBD_DbgLog("\t\t\t\tHAL_PCD_MspInit()\r\n");
        HAL_PCD_MspInit(hpcd);
    }

    hpcd->State = HAL_PCD_STATE_BUSY;

    /* Init endpoints structures */
    for (i = 0U; i < hpcd->Init.dev_endpoints ; i++)
    {
        /* Init ep structure */
        hpcd->IN_ep[i].is_in = 1U;
        hpcd->IN_ep[i].num = i;
        /* Control until ep is actvated */
        hpcd->IN_ep[i].type = PCD_EP_TYPE_CTRL;
        hpcd->IN_ep[i].maxpacket =  0U;
        hpcd->IN_ep[i].xfer_buff = 0U;
        hpcd->IN_ep[i].xfer_len = 0U;
    }

    for (i = 0U; i < hpcd->Init.dev_endpoints ; i++)
    {
        hpcd->OUT_ep[i].is_in = 0U;
        hpcd->OUT_ep[i].num = i;
        /* Control until ep is activated */
        hpcd->OUT_ep[i].type = PCD_EP_TYPE_CTRL;
        hpcd->OUT_ep[i].maxpacket = 0U;
        hpcd->OUT_ep[i].xfer_buff = 0U;
        hpcd->OUT_ep[i].xfer_len = 0U;
    }

    return HAL_OK;
}

/**
  * @brief  DeInitializes the PCD peripheral 
  * @param  hpcd PCD handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_DeInit(PCD_HandleTypeDef *hpcd)
{
    /* Check the PCD handle allocation */
    if(hpcd == NULL)
    {
        return HAL_ERROR;
    }

    hpcd->State = HAL_PCD_STATE_BUSY;

    /* Stop Device */
    HAL_PCD_Stop(hpcd);

    /* DeInit the low level hardware */
    HAL_PCD_MspDeInit(hpcd);

    hpcd->State = HAL_PCD_STATE_RESET; 

    return HAL_OK;
}

/**
  * @brief  Initializes the PCD MSP.
  * @param  hpcd PCD handle
  * @retval None
  */
#if 0
__WEAK
void HAL_PCD_MspInit(PCD_HandleTypeDef *hpcd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);

    /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_MspInit could be implemented in the user file
    */
}
#endif
/**
  * @brief  DeInitializes PCD MSP.
  * @param  hpcd PCD handle
  * @retval None
  */
__WEAK
void HAL_PCD_MspDeInit(PCD_HandleTypeDef *hpcd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);

    /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_MspDeInit could be implemented in the user file
    */
}
  
/**
  * @brief  Start the USB device.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_Start(PCD_HandleTypeDef *hpcd)
{
    hpcd->Instance->usb_config.BF.cr_usb_en = 1;

    return HAL_OK;
}

/**
  * @brief  Stop the USB device.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_Stop(PCD_HandleTypeDef *hpcd)
{ 
    __HAL_LOCK(hpcd); 

    /* disable all interrupts and force USB reset */
    USB_HAL_Interrupts_Init(DISABLE);
    USB_HAL_Interrupts_LPM_Init(DISABLE);
    hpcd->Instance->usb_config.BF.cr_usb_en = 0;
    hpcd->Instance->usb_config.BF.cr_usb_en = 1;
    
    /* clear interrupt status register */
    hpcd->Instance->usb_int_clear.WORD = 0x3FFFF;

    /* switch-off device */
    USB_HAL_Power_Off();
    
    __HAL_UNLOCK(hpcd);
    
    return HAL_OK;
}


/**
  * @brief  This function handles PCD interrupt request.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
void HAL_PCD_IRQHandler(PCD_HandleTypeDef *hpcd)
{
    PCD_EPTypeDef *ep;
    
    /* SOF */
    if (__HAL_PCD_GET_FLAG(hpcd, USB_INT_SOF)){
        USBD_DbgLog("SOF\r\n");
        /*************************************/
        HAL_PCD_SOFCallback(hpcd);
        /*************************************/
        __HAL_PCD_CLEAR_FLAG(hpcd, USB_INT_SOF);
        return ;
    }

