espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/bouffalolab/repo/components/platform/soc/bl702/bl702_usb_cdc/Src/bl702_hal_pcd.c
    /* reset */
    if (__HAL_PCD_GET_FLAG(hpcd, USB_INT_RESET)){
        USBD_DbgLog("r\r\n");
        /*************************************/
        //USB_Stress_Test_Origin_Init();
        extern void USB_Device_Init(void);
        USB_Device_Init();
        HAL_PCD_ResetCallback(hpcd);
        HAL_PCD_SetAddress(hpcd, 0U);
        //USB_INOUT_MEM_Init();
        /*************************************/
        __HAL_PCD_CLEAR_FLAG(hpcd, USB_INT_RESET);
        return ;
    }

    /* vbus toggle */
    if (__HAL_PCD_GET_FLAG(hpcd, USB_INT_VBUS_TGL)){
        USBD_DbgLog("vbus toggle\r\n");
        /*************************************/
        /*************************************/
        __HAL_PCD_CLEAR_FLAG(hpcd, USB_INT_VBUS_TGL);
        return ;
    }

    /* get dct cmd */
    if (__HAL_PCD_GET_FLAG(hpcd, USB_INT_GET_DCT_CMD)){
        USBD_DbgLog("get dct cmd\r\n");
        /*************************************/
        /*************************************/
        __HAL_PCD_CLEAR_FLAG(hpcd, USB_INT_GET_DCT_CMD);
        return ;
    }

    /* EP0 setup cmd */
    if (__HAL_PCD_GET_FLAG(hpcd, USB_INT_EP0_SETUP_CMD)){
        USBD_DbgLog("EP0 setup cmd\r\n");
        /*************************************/
        /*************************************/
        __HAL_PCD_CLEAR_FLAG(hpcd, USB_INT_EP0_SETUP_CMD);
        return ;
    }

    /* EP0 setup done */
    if(__HAL_PCD_GET_FLAG(hpcd, USB_INT_EP0_SETUP_DONE)){
        USBD_DbgLog("ss\r\n");
        /*************************************/
        uint16_t count=0U;
        uint32_t timeout = 0x0000FFFF;
        do{
            count = PCD_GET_EP_RX_CNT(hpcd->Instance, 0);
        }while(--timeout&&(count<8));
        if(count){
            ep = &hpcd->OUT_ep[0];
            ep->xfer_count = count;
            PCD_ReadPMA(hpcd->Instance, (uint8_t*)(void*)hpcd->Setup , EP_ID0, count);
            HAL_PCD_SetupStageCallback(hpcd);
            USB_Set_EPx_Rdy(EP_ID0);
        }else{
            USB_Set_EPx_Rdy(EP_ID0);
        }
        USB_Set_EPx_Rdy(USB_OUT_EP);
        /*************************************/
        __HAL_PCD_CLEAR_FLAG(hpcd, USB_INT_EP0_SETUP_DONE);
        return ;
    }

    /* EP0 in cmd */
    if (__HAL_PCD_GET_FLAG(hpcd, USB_INT_EP0_IN_CMD)){
        USBD_DbgLog("EP0 in cmd\r\n");
        /*************************************/
        /*************************************/
        __HAL_PCD_CLEAR_FLAG(hpcd, USB_INT_EP0_IN_CMD);
        return ;
    }

    /* EP0 in done */
    if(__HAL_PCD_GET_FLAG(hpcd, USB_INT_EP0_IN_DONE)){
        USBD_DbgLog("is\r\n");
        /*************************************/
        ep = &hpcd->IN_ep[0];
        ep->xfer_buff += ep->xfer_count;
        HAL_PCD_DataInStageCallback(hpcd, 0U);
        USB_Set_EPx_Rdy(EP_ID0);
        /*************************************/
        __HAL_PCD_CLEAR_FLAG(hpcd, USB_INT_EP0_IN_DONE);
        return ;
    }

    /* EP0 out cmd */
    if (__HAL_PCD_GET_FLAG(hpcd, USB_INT_EP0_OUT_CMD)){
        USBD_DbgLog("EP0 out cmd\r\n");
        /*************************************/
        /*************************************/
        __HAL_PCD_CLEAR_FLAG(hpcd, USB_INT_EP0_OUT_CMD);
        return ;
    }

    /* EP0 out done */
    if(__HAL_PCD_GET_FLAG(hpcd, USB_INT_EP0_OUT_DONE)){
        USBD_DbgLog("os\r\n");
        /*************************************/
        ep = &hpcd->OUT_ep[0];
        uint16_t count = 0;
        count = PCD_GET_EP_RX_CNT(hpcd->Instance, ep->num);
        if (count){
            ep->xfer_count = count;
            PCD_ReadPMA(hpcd->Instance, ep->xfer_buff, 0, count);
            HAL_PCD_DataOutStageCallback(hpcd, 0U);
            ep->xfer_buff+=ep->xfer_count;
            USB_Set_EPx_Rdy(EP_ID0);

        }else{
            USB_Set_EPx_Rdy(EP_ID0);
        }
        /*************************************/
        __HAL_PCD_CLEAR_FLAG(hpcd, USB_INT_EP0_OUT_DONE);
        return ;
    }

    /*************************************************************************/
    /* EP1_CMD -> EP1_DONE -> ...... -> EP7_CMD -> EP7_DONE */
    uint32_t inoutFlag=1;
    USB_INT_Type epint=USB_INT_EP1_CMD;
    USB_EP_ID epnum=EP_ID0;
    for(epint=USB_INT_EP1_CMD,inoutFlag=1;epint<=USB_INT_EP7_DONE;epint++,inoutFlag++){
        if (__HAL_PCD_GET_FLAG(hpcd, epint)){
            epnum = (epint-USB_INT_EP0_OUT_CMD)>>1;
            if(inoutFlag&0x1){
                /* cmd -> in */
                HAL_PCD_DataInStageCallback(hpcd, epnum);
            }else{
                /* done -> out */
                //hpcd->OUT_ep[epnum].xfer_count = PCD_GET_EP_RX_CNT(hpcd->Instance, epnum);
                //HAL_PCD_DataOutStageCallback(hpcd, epnum);
                extern void usb_cdc_data_out_irq(uint8_t epnum);
                usb_cdc_data_out_irq(epnum);
            }
            __HAL_PCD_CLEAR_FLAG(hpcd, epint);
            return ;
        }
    }
    /*************************************************************************/

    /* reset end */
    if(__HAL_PCD_GET_FLAG(hpcd, USB_INT_RESET_END)){
        USBD_DbgLog("re\r\n");
        /*************************************/
        USB_Set_EPx_Rdy(EP_ID0);
        /*************************************/
        __HAL_PCD_CLEAR_FLAG(hpcd, USB_INT_RESET_END);
        return ;
    }

    /* LPM wakeup */
    /* usb wakeup interrupt, need update by reg_excel_files */
    if (__HAL_PCD_GET_FLAG(hpcd, USB_INT_LPM_WAKEUP)){
        /*************************************/
        /*set wInterrupt_Mask global variable*/
        //HAL_PCD_ResumeCallback(hpcd);
        /*************************************/
        __HAL_PCD_CLEAR_FLAG(hpcd, USB_INT_LPM_WAKEUP);
        return ;
    }

    /* LPM packet */
    /* usb suspend interrupt, need update by reg_excel_files */
    if (__HAL_PCD_GET_FLAG(hpcd, USB_INT_LPM_PACKET)){
        /*************************************/
        /* Force low-power mode in the macrocell */
        if (__HAL_PCD_GET_FLAG(hpcd, USB_INT_LPM_WAKEUP) == 0)
        {
            //HAL_PCD_SuspendCallback(hpcd);
        }
        /*************************************/
        __HAL_PCD_CLEAR_FLAG(hpcd, USB_INT_LPM_PACKET);
        return ;
    }

    /* lost 3 SOF */
    if (__HAL_PCD_GET_FLAG(hpcd, USB_INT_LOST_SOF_3_TIMES)){
        USBD_DbgLog("Lost 3 SOFs\r\n");
        /*************************************/
        /*************************************/
        __HAL_PCD_CLEAR_FLAG(hpcd, USB_INT_LOST_SOF_3_TIMES);
        return ;
    }

    /* error */
    if (__HAL_PCD_GET_FLAG(hpcd, USB_INT_ERROR)){
        USBD_DbgLog("USB bus error 0x%08x; EP2 fifo status 0x%08x\r\n",*(volatile uint32_t *)(0x4000D81C),*(volatile uint32_t *)(0x4000D920));
        /*************************************/
        /*************************************/
        __HAL_PCD_CLEAR_FLAG(hpcd, USB_INT_ERROR);
        return ;
    }
}




/**
  * @brief  Data out stage callbacks
  * @param  hpcd PCD handle
  * @param  epnum endpoint number
  * @retval None
  */
#if 0
__WEAK
void HAL_PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);
    UNUSED(epnum);

    /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_DataOutStageCallback could be implemented in the user file
    */ 
}
#endif
/**
  * @brief  Data IN stage callbacks
  * @param  hpcd PCD handle
  * @param  epnum endpoint number
  * @retval None
  */
#if 0
__WEAK
void HAL_PCD_DataInStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);
    UNUSED(epnum);

    /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_DataInStageCallback could be implemented in the user file
    */ 
}
#endif
/**
  * @brief  Setup stage callback
  * @param  hpcd PCD handle
  * @retval None
  */
#if 0
__WEAK
void HAL_PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);

    /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_SetupStageCallback could be implemented in the user file
    */
}
#endif
/**
  * @brief  USB Start Of Frame callbacks
  * @param  hpcd PCD handle
  * @retval None
  */
#if 0
__WEAK
void HAL_PCD_SOFCallback(PCD_HandleTypeDef *hpcd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);

    /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_SOFCallback could be implemented in the user file
    */ 
}
#endif
/**
  * @brief  USB Reset callbacks
  * @param  hpcd PCD handle
  * @retval None
  */
#if 0
__WEAK
void HAL_PCD_ResetCallback(PCD_HandleTypeDef *hpcd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);

    /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_ResetCallback could be implemented in the user file
    */ 
}
#endif
/**
  * @brief  Suspend event callbacks
  * @param  hpcd PCD handle
  * @retval None
  */
#if 0
__WEAK
void HAL_PCD_SuspendCallback(PCD_HandleTypeDef *hpcd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);

    /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_SuspendCallback could be implemented in the user file
    */ 
}
#endif
/**
  * @brief  Resume event callbacks
  * @param  hpcd PCD handle
  * @retval None
  */
#if 0
__WEAK
void HAL_PCD_ResumeCallback(PCD_HandleTypeDef *hpcd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);

    /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_ResumeCallback could be implemented in the user file
    */ 
}
#endif
/**
  * @brief  Incomplete ISO OUT callbacks
  * @param  hpcd PCD handle
  * @param  epnum endpoint number
  * @retval None
  */
#if 0
__WEAK
void HAL_PCD_ISOOUTIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);
    UNUSED(epnum);

    /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_ISOOUTIncompleteCallback could be implemented in the user file
    */ 
}
#endif
/**
  * @brief  Incomplete ISO IN  callbacks
  * @param  hpcd PCD handle
  * @param  epnum endpoint number
  * @retval None
  */
#if 0
__WEAK
void HAL_PCD_ISOINIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);
    UNUSED(epnum);

    /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_ISOINIncompleteCallback could be implemented in the user file
    */ 
}
#endif
/**
  * @brief  Connection event callbacks
  * @param  hpcd PCD handle
  * @retval None
  */
#if 0
__WEAK
void HAL_PCD_ConnectCallback(PCD_HandleTypeDef *hpcd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);

    /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_ConnectCallback could be implemented in the user file
    */ 
}
#endif
/**
  * @brief  Disconnection event callbacks
  * @param  hpcd PCD handle
  * @retval None
  */
#if 0
__WEAK
void HAL_PCD_DisconnectCallback(PCD_HandleTypeDef *hpcd)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hpcd);

    /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PCD_DisconnectCallback could be implemented in the user file
    */ 
}
#endif
/**
  * @brief  Connect the USB device 
  * @param  hpcd PCD handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_DevConnect(PCD_HandleTypeDef *hpcd)
{
    __HAL_LOCK(hpcd); 

