espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/bouffalolab/repo/components/platform/soc/bl702/bl702_usb_cdc/Src/bl702_hal_pcd.c
    /* Enabling DP Pull-Down bit to Connect internal pull-up on USB DP line */
    /* D+ pull-up ENABLE, not used here */

    __HAL_UNLOCK(hpcd); 
    return HAL_OK;
}
/**
  * @brief  Disconnect the USB device 
  * @param  hpcd PCD handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_DevDisconnect(PCD_HandleTypeDef *hpcd)
{
    __HAL_LOCK(hpcd); 

    /* Disable DP Pull-Down bit*/
    /* D+ pull-up DISABLE, not used here */

    __HAL_UNLOCK(hpcd); 
    return HAL_OK;
}
/**
  * @brief  Set the USB Device address 
  * @param  hpcd PCD handle
  * @param  address new device address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_SetAddress(PCD_HandleTypeDef *hpcd, uint8_t address)
{
    __HAL_LOCK(hpcd); 

    if(address == 0U) 
    {
     /* set device address and enable function */
        hpcd->USB_Address = address;
        USB_Set_Device_Addr(address);
    }
    else /* USB Address will be applied later */
    {
         hpcd->USB_Address = address;
         USB_Set_Device_Addr(address);
    }

    __HAL_UNLOCK(hpcd);   
    return HAL_OK;
}
/**
  * @brief  Open and configure an endpoint
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @param  ep_mps endpoint max packert size
  * @param  ep_type endpoint type   
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_EP_Open(PCD_HandleTypeDef *hpcd, uint8_t ep_addr, uint16_t ep_mps, uint8_t ep_type)
{
    HAL_StatusTypeDef  ret = HAL_OK;
    PCD_EPTypeDef *ep;

    if ((ep_addr & 0x80U) == 0x80U)
    {
        ep = &hpcd->IN_ep[ep_addr & 0x7FU];
    }
    else
    {
        ep = &hpcd->OUT_ep[ep_addr & 0x7FU];
    }
    ep->num   = ep_addr & 0x7FU;

    ep->is_in = (0x80U & ep_addr) != 0U;
    ep->maxpacket = ep_mps;
    ep->type = ep_type;

    __HAL_LOCK(hpcd); 

    /* initialize Endpoint */
    if(ep->num){
        /* EP1 - EP7 : set EP type */
        switch (ep->type)
        {
            case PCD_EP_TYPE_CTRL:
                PCD_SET_EPTYPE(hpcd->Instance, ep->num, PCD_EP_TYPE_CTRL);
                break;
            case PCD_EP_TYPE_BULK:
                PCD_SET_EPTYPE(hpcd->Instance, ep->num, PCD_EP_TYPE_BULK);
                break;
            case PCD_EP_TYPE_INTR:
                PCD_SET_EPTYPE(hpcd->Instance, ep->num, PCD_EP_TYPE_INTR);
                break;
            case PCD_EP_TYPE_ISOC:
                PCD_SET_EPTYPE(hpcd->Instance, ep->num, PCD_EP_TYPE_ISOC);
                break;
            default:
                break;
        }
    }else{
        /* EP0 : do nothing */
    }

    /* ST EndPoint need set EA[3:0] field ( endpoint_address ) for working, not used here */

    /* Single Buffer */
    if (ep->doublebuffer == 0U) 
    {
        if (ep->is_in)
        {
            /*Set the endpoint Transmit buffer address */
            /* this part should be used after reg_relevant_files has been updated */
            /* Configure NAK status for the Endpoint*/
            /* set ep ack for next transfer */
            //PCD_SET_EP_TX_STATUS(hpcd->Instance, ep->num, PCD_EP_STATE_ACK);
        }
        else
        {
            /*Set the endpoint Receive buffer address */
            /* this part should be used after reg_relevant_files has been updated */
            /*Set the endpoint Receive buffer counter*/
            /* this function is for initial ep maxpacket length */
            /* Configure VALID status for the Endpoint*/
            //PCD_SET_EP_RX_STATUS(hpcd->Instance, ep->num, PCD_EP_STATE_ACK);
        }
    }
    /*Double Buffer*/
    else
    {
        /* hardware designs has no double buffer function */
    }

    __HAL_UNLOCK(hpcd);   
    return ret;
}


/**
  * @brief  Deactivate an endpoint
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_EP_Close(PCD_HandleTypeDef *hpcd, uint8_t ep_addr)
{  
    PCD_EPTypeDef *ep;

    if ((ep_addr & 0x80U) == 0x80U)
    {
        ep = &hpcd->IN_ep[ep_addr & 0x7FU];
    }
    else
    {
        ep = &hpcd->OUT_ep[ep_addr & 0x7FU];
    }
    ep->num   = ep_addr & 0x7FU;

    ep->is_in = (0x80U & ep_addr) != 0U;

    __HAL_LOCK(hpcd); 

    if (ep->doublebuffer == 0U) 
    {
        if (ep->is_in)
        {
            /* Configure DISABLE status for the Endpoint*/
            PCD_SET_EP_IN_STATUS(hpcd->Instance, ep->num, PCD_EP_STATE_NACK);
        }
        else
        {
            /* Configure DISABLE status for the Endpoint*/
            PCD_SET_EP_OUT_STATUS(hpcd->Instance, ep->num, PCD_EP_STATE_NACK);
        }
    }
    /*Double Buffer*/
    else
    {
        /* hardware designs has no double buffer function */
    } 

    __HAL_UNLOCK(hpcd);   
    return HAL_OK;
}


/**
  * @brief  Receive an amount of data  
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @param  pBuf pointer to the reception buffer   
  * @param  len amount of data to be received
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_EP_Receive(PCD_HandleTypeDef *hpcd, uint8_t ep_addr, uint8_t *pBuf, uint32_t len)
{
  
    PCD_EPTypeDef *ep;

    ep = &hpcd->OUT_ep[ep_addr & 0x7FU];

    /*setup and start the Xfer */
    ep->xfer_buff = pBuf;  
    ep->xfer_len = len;
    ep->xfer_count = 0U;
    ep->is_in = 0U;
    ep->num = ep_addr & 0x7FU;

    /* Multi packet transfer*/
    if (ep->xfer_len > ep->maxpacket)
    {
        len=ep->maxpacket;
        ep->xfer_len-=len; 
    }
    else
    {
        len=ep->xfer_len;
        ep->xfer_len =0U;
    }

    /* configure and validate Rx endpoint */
    if (ep->doublebuffer == 0) 
    {
        PCD_ReadPMA(hpcd->Instance, ep->xfer_buff, ep->num, len);
        /* set target_transmit_data_length for IN/TX stage */
        ep->xfer_count = len;
        /* set target_received_data_length for OUT/RX stage */
        /*Set RX buffer count*/
    }
    else
    {
        /* hardware designs has no double buffer function */
    } 

    return HAL_OK;
}

/**
  * @brief  Get Received Data Size
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @retval Data Size
  */
uint16_t HAL_PCD_EP_GetRxCount(PCD_HandleTypeDef *hpcd, uint8_t ep_addr)
{
    return hpcd->OUT_ep[ep_addr & 0x7FU].xfer_count;
}
/**
  * @brief  Send an amount of data  
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @param  pBuf pointer to the transmission buffer   
  * @param  len amount of data to be sent
  * @retval HAL status
  */
#if 0
HAL_StatusTypeDef HAL_PCD_EP_Transmit(PCD_HandleTypeDef *hpcd, uint8_t ep_addr, uint8_t *pBuf, uint32_t len)
{
    PCD_EPTypeDef *ep;
    uint16_t pmabuffer = 0U;
    UNUSED(pmabuffer);
    ep = &hpcd->IN_ep[ep_addr & 0x7FU];

