espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/bouffalolab/repo/components/platform/soc/bl702/bl702_usb_cdc/Src/bl702_hal_pcd.c
    /*setup and start the Xfer */
    ep->xfer_buff = pBuf;  
    ep->xfer_len = len;
    ep->xfer_count = 0U;
    ep->is_in = 1U;
    ep->num = ep_addr & 0x7FU;

    /*Multi packet transfer*/
    if (ep->xfer_len > ep->maxpacket)
    {
        len=ep->maxpacket;
        ep->xfer_len-=len; 
    }
    else
    {  
        len=ep->xfer_len;
        ep->xfer_len =0U;
    }
    /* configure and validate Tx endpoint */
    if (ep->doublebuffer == 0U) 
    {
        PCD_WritePMA(hpcd->Instance, ep->xfer_buff, ep->num, len);
        if(EP_ID0!=ep->num){
            USB_Set_EPx_Status(ep->num,USB_EP_STATUS_ACK);
        }
        /* set target_transmit_data_length for IN/TX stage */
        ep->xfer_count = len;
    }
    else
    {
        /* hardware designs has no double buffer function */
    }

    return HAL_OK;
}
#else
HAL_StatusTypeDef HAL_PCD_EP_Transmit(PCD_HandleTypeDef *hpcd, uint8_t ep_addr, uint8_t *pBuf, uint32_t len)
{
    PCD_EPTypeDef *ep;
    uint16_t pmabuffer = 0U;
    UNUSED(pmabuffer);
    ep = &hpcd->IN_ep[ep_addr & 0x7FU];

    /*setup and start the Xfer */
    ep->xfer_buff = pBuf;
    ep->xfer_len = len;
    ep->xfer_count = 0U;
    ep->is_in = 1U;
    ep->num = ep_addr & 0x7FU;

    if(ep->num){
        while(ep->xfer_len){
            //MSG("!");
            /*Multi packet transfer*/
            if (ep->xfer_len > ep->maxpacket)
            {
                len=ep->maxpacket;
                ep->xfer_len-=len;
            }
            else
            {
                len=ep->xfer_len;
                ep->xfer_len =0U;
            }

            PCD_WritePMA(hpcd->Instance, ep->xfer_buff, ep->num, len);
            if(EP_ID0!=ep->num){
                USB_Set_EPx_Status(ep->num,USB_EP_STATUS_ACK);
            }
        }
    }else{
        /*Multi packet transfer*/
        if (ep->xfer_len > ep->maxpacket)
        {
            len=ep->maxpacket;
            ep->xfer_len-=len;
        }
        else
        {
            len=ep->xfer_len;
            ep->xfer_len =0U;
        }
        /* configure and validate Tx endpoint */
        if (ep->doublebuffer == 0U)
        {
            //MSG("?");
            PCD_WritePMA(hpcd->Instance, ep->xfer_buff, ep->num, len);
            if(EP_ID0!=ep->num){
                USB_Set_EPx_Status(ep->num,USB_EP_STATUS_ACK);
            }
            /* set target_transmit_data_length for IN/TX stage */
            ep->xfer_count = len;
        }
        else
        {
            /* hardware designs has no double buffer function */
        }
    }

    return HAL_OK;
}
#endif
/**
  * @brief  Set a STALL condition over an endpoint
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_EP_SetStall(PCD_HandleTypeDef *hpcd, uint8_t ep_addr)
{
    PCD_EPTypeDef *ep;

    __HAL_LOCK(hpcd); 

    if ((0x80U & ep_addr) == 0x80U)
    {
        ep = &hpcd->IN_ep[ep_addr & 0x7FU];
    }
    else
    {
        ep = &hpcd->OUT_ep[ep_addr];
    }

    ep->is_stall = 1;
    ep->num   = ep_addr & 0x7FU;
    ep->is_in = ((ep_addr & 0x80U) == 0x80U);

    if (ep->num == 0U)
    {
        /* This macro sets STALL status for RX & TX*/ 
        PCD_SET_EP_INOUT_STATUS(hpcd->Instance, ep->num, PCD_EP_STATE_STALL, PCD_EP_STATE_STALL);
    }
    else
    {
        if (ep->is_in)
        {
            PCD_SET_EP_IN_STATUS(hpcd->Instance, ep->num , PCD_EP_STATE_STALL);
        }
        else
        {
            PCD_SET_EP_OUT_STATUS(hpcd->Instance, ep->num , PCD_EP_STATE_STALL);
        }
    }
    __HAL_UNLOCK(hpcd); 

    return HAL_OK;
}

/**
  * @brief  Clear a STALL condition over in an endpoint
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_EP_ClrStall(PCD_HandleTypeDef *hpcd, uint8_t ep_addr)
{
    PCD_EPTypeDef *ep;

    if ((0x80U & ep_addr) == 0x80U)
    {
        ep = &hpcd->IN_ep[ep_addr & 0x7FU];
    }
    else
    {
        ep = &hpcd->OUT_ep[ep_addr];
    }

    ep->is_stall = 0U;
    ep->num   = ep_addr & 0x7FU;
    ep->is_in = ((ep_addr & 0x80U) == 0x80U);

    __HAL_LOCK(hpcd); 

    if (ep->is_in)
    {
        PCD_SET_EP_IN_STATUS(hpcd->Instance, ep->num, PCD_EP_STATE_NSTALL);
    }
    else
    {
        PCD_SET_EP_OUT_STATUS(hpcd->Instance, ep->num, PCD_EP_STATE_NSTALL);
    }
    __HAL_UNLOCK(hpcd); 

    return HAL_OK;
}

/**
  * @brief  Flush an endpoint
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PCD_EP_Flush(PCD_HandleTypeDef *hpcd, uint8_t ep_addr)
{ 
    return HAL_OK;
}

/**
  * @brief  HAL_PCD_ActivateRemoteWakeup : active remote wakeup signalling
* @param  hpcd PCD handle
* @retval HAL status
*/
HAL_StatusTypeDef HAL_PCD_ActivateRemoteWakeup(PCD_HandleTypeDef *hpcd)
{
    if (hpcd->Init.lpm_enable ==1)
    {
        /* Apply L1 Resume */
        /* operate reg to send L1 signal to host */
        /* hpcd->Instance->..... */
    }
    else
    {
        /* Apply L2 Resume */
        /* operate reg to send L2 signal to host */
        /* hpcd->Instance->..... */
    }

    return (HAL_OK);
}

/**
* @brief  HAL_PCD_DeActivateRemoteWakeup : de-active remote wakeup signalling
* @param  hpcd PCD handle
* @retval HAL status
*/
HAL_StatusTypeDef HAL_PCD_DeActivateRemoteWakeup(PCD_HandleTypeDef *hpcd)
{
    if (hpcd->Init.lpm_enable ==1)
    {
        /* Release L1 Resume */
        /* operate reg to release L1 signal */
        /* hpcd->Instance->..... */
    }
    else
    {
        /* Release L2 Resume */
        /* operate reg to release L2 signal */
        /* hpcd->Instance->..... */
    }

    return (HAL_OK);
}


/**
  * @brief  Return the PCD state
  * @param  hpcd PCD handle
  * @retval HAL state
  */
PCD_StateTypeDef HAL_PCD_GetState(PCD_HandleTypeDef *hpcd)
{
    return hpcd->State;
}

/**
  * @brief Copy a buffer from user memory area to packet memory area (PMA)
  * @param   USBx USB peripheral instance register address.
  * @param   pbUsrBuf pointer to user memory area.
  * @param   wPMABufAddr address into PMA.
  * @param   wNBytes no. of bytes to be copied.
  * @retval None
  */
void PCD_WritePMA(USB_TypeDef  *USBx, uint8_t *pbUsrBuf, uint16_t ep_id, uint16_t wNBytes)
{
    USB_EPx_Write_Data_To_FIFO(ep_id,pbUsrBuf,wNBytes);
}

/**
  * @brief Copy a buffer from user memory area to packet memory area (PMA)
  * @param   USBx USB peripheral instance register address.
  * @param   pbUsrBuf    = pointer to user memory area.
  * @param   wPMABufAddr address into PMA.
  * @param   wNBytes no. of bytes to be copied.
  * @retval None
  */
void PCD_ReadPMA(USB_TypeDef  *USBx, uint8_t *pbUsrBuf, uint16_t ep_id, uint16_t wNBytes)
{
    if(pbUsrBuf == NULL && wNBytes > 0){
        //printf("##PCD_ReadPMA Error: %p##\r\n\r\n", (void *)__builtin_return_address(0));
        return;
    }
    USB_EPx_Read_Data_From_FIFO(ep_id,pbUsrBuf,wNBytes);
}

/**
  * @brief  This function handles PCD Endpoint interrupt request.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
HAL_StatusTypeDef PCD_EP_ISR_Handler(PCD_HandleTypeDef *hpcd)
{
/*
    PCD_EPTypeDef *ep;
    uint16_t count=0U;
    uint8_t EPindex;
    volatile uint32_t wIstr;
    uint8_t tmpBuff[128] = {0};
*/


    /* #if 0    #endif */

    return HAL_OK;
}



HAL_StatusTypeDef  HAL_PCDEx_PMAConfig(PCD_HandleTypeDef *hpcd, uint16_t ep_id, uint16_t ep_kind, uint16_t ep_dir, uint32_t pmaadress, uint32_t pmaadressbak)
{
  PCD_EPTypeDef *ep;
  
