espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/bouffalolab/repo/components/platform/soc/bl702/bl702_usb_cdc/Src/bl702_hal_pcd.c
  /* initialize ep structure*/
  if (ep_dir == PCD_IN_BUF)
  {
    ep = &hpcd->IN_ep[ep_id];
  }
  else
  {
    ep = &hpcd->OUT_ep[ep_id];
  }
  
  /* Here we check if the endpoint is single or double Buffer*/
  if (ep_kind == PCD_SNG_BUF)
  {
    /*Single Buffer*/
    ep->doublebuffer = 0U;
    /*Configure the PMA*/
    ep->pmaadress = pmaadress;

    ep->xfer_buff = (uint8_t *)pmaadress;
  }
  else /*USB_DBL_BUF*/
  {
    /*Double Buffer Endpoint*/
    ep->doublebuffer = 1U;
    /*Configure the PMA*/
    ep->pmaaddr0 =  pmaadress;
    ep->pmaaddr1 =  pmaadressbak;
  }

  return HAL_OK;
}



void USB_HAL_Power_Up(void)
{
    uint32_t tmpVal = 0;

    tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR);
    tmpVal=BL_SET_REG_BIT(tmpVal,GLB_PU_USB);
    BL_WR_REG(GLB_BASE,GLB_USB_XCVR,tmpVal);
}
void USB_HAL_Power_Off(void)
{
    uint32_t tmpVal = 0;

    tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR);
    tmpVal=BL_CLR_REG_BIT(tmpVal,GLB_PU_USB);
    BL_WR_REG(GLB_BASE,GLB_USB_XCVR,tmpVal);
}
void USB_HAL_Xcvr_Config(BL_Fun_Type NewState)
{
    uint32_t tmpVal = 0;
    
    if(NewState!=DISABLE) {
#ifdef USE_EXTERNAL_TRANSCEIVER
        tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR_CONFIG);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_REG_USB_USE_XCVR,0);  //use external tranceiver
        BL_WR_REG(GLB_BASE,GLB_USB_XCVR_CONFIG,tmpVal);
#else
#ifdef USE_INTERNAL_TRANSCEIVER
    #if 1
        tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_PU_USB,1);
        BL_WR_REG(GLB_BASE,GLB_USB_XCVR,tmpVal);
        
        tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_SUS,0);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_SPD,1);       //0 for 1.1 ls,1 for 1.1 fs
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_DATA_CONVERT,0);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_OEB_SEL,0);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_ROUT_PMOS,3);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_ROUT_NMOS,3);
        BL_WR_REG(GLB_BASE,GLB_USB_XCVR,tmpVal);
        
        tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR_CONFIG);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_SLEWRATE_P_RISE,2);   //1 for 1.1 ls
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_SLEWRATE_P_FALL,2);   //1 for 1.1 ls
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_SLEWRATE_M_RISE,2);   //1 for 1.1 ls
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_SLEWRATE_M_FALL,2);   //1 for 1.1 ls
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_RES_PULLUP_TUNE,5);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_REG_USB_USE_XCVR,1);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_BD_VTH,1);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_V_HYS_P,2);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_V_HYS_M,2);
        BL_WR_REG(GLB_BASE,GLB_USB_XCVR_CONFIG,tmpVal);

        ///* force BD=1, not use */
        //tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR);
        //tmpVal=BL_SET_REG_BIT(tmpVal,GLB_PU_USB_LDO);
        //BL_WR_REG(GLB_BASE,GLB_USB_XCVR,tmpVal);

        /* BD_voltage_thresdhold=2.8V */
        tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR_CONFIG);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_BD_VTH,7);
        BL_WR_REG(GLB_BASE,GLB_USB_XCVR_CONFIG,tmpVal);

    #else
        tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_PU_USB,1);
        BL_WR_REG(GLB_BASE,GLB_USB_XCVR,tmpVal);
        
        tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_SUS,0);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_SPD,0);       //0 for 1.1 ls,1 for 1.1 fs
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_DATA_CONVERT,0);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_OEB_SEL,0);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_ROUT_PMOS,3);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_ROUT_NMOS,3);
        BL_WR_REG(GLB_BASE,GLB_USB_XCVR,tmpVal);
        
        tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR_CONFIG);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_SLEWRATE_P_RISE,1);   //4 for 1.1 fs
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_SLEWRATE_P_FALL,1);   //3 for 1.1 fs
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_SLEWRATE_M_RISE,1);   //4 for 1.1 fs
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_SLEWRATE_M_FALL,1);   //3 for 1.1 fs
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_RES_PULLUP_TUNE,5);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_REG_USB_USE_XCVR,1);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_BD_VTH,1);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_V_HYS_P,2);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_V_HYS_M,2);
        BL_WR_REG(GLB_BASE,GLB_USB_XCVR_CONFIG,tmpVal);
    #endif

    tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR);
    tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_ENUM,1);
    BL_WR_REG(GLB_BASE,GLB_USB_XCVR,tmpVal);
#endif
#endif
    } else {
#ifdef USE_INTERNAL_TRANSCEIVER
        tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_ENUM,0);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_PU_USB,0);
        BL_WR_REG(GLB_BASE,GLB_USB_XCVR,tmpVal);

        ///* force BD=1, not use */
        //tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR);
        //tmpVal=BL_SET_REG_BIT(tmpVal,GLB_PU_USB_LDO);
        //BL_WR_REG(GLB_BASE,GLB_USB_XCVR,tmpVal);

        /* BD_voltage_thresdhold=2.8V */
        tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR_CONFIG);
        tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_BD_VTH,7);
        BL_WR_REG(GLB_BASE,GLB_USB_XCVR_CONFIG,tmpVal);

#else
    tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR_CONFIG);
    tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_REG_USB_USE_XCVR,1);  //use internal tranceiver
    BL_WR_REG(GLB_BASE,GLB_USB_XCVR_CONFIG,tmpVal);
    
    tmpVal=BL_RD_REG(GLB_BASE,GLB_USB_XCVR);
    tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_USB_ENUM,0);
    tmpVal=BL_SET_REG_BITS_VAL(tmpVal,GLB_PU_USB,1);
    BL_WR_REG(GLB_BASE,GLB_USB_XCVR,tmpVal);
#endif
    }
}
void USB_HAL_GPIO_Init(BL_Fun_Type NewState)
{
    GLB_GPIO_Cfg_Type cfg;
    
    if(NewState!=DISABLE){
        cfg.gpioMode=GPIO_MODE_AF;
        cfg.pullType=GPIO_PULL_NONE;
        cfg.drive=1;
        cfg.smtCtrl=1;
        
#ifdef USE_EXTERNAL_TRANSCEIVER
        cfg.gpioPin=USB_OEN_PIN_NUM;
        cfg.gpioFun=USB_OEN_PIN_FUNC;
        GLB_GPIO_Init(&cfg);
        
        cfg.gpioPin=USB_SUS_PIN_NUM;
        cfg.gpioFun=USB_SUS_PIN_FUNC;
        GLB_GPIO_Init(&cfg);
        
        cfg.gpioPin=USB_DP_PIN_NUM;
        cfg.gpioFun=USB_DP_PIN_FUNC;
        GLB_GPIO_Init(&cfg);
        
        cfg.gpioPin=USB_DN_PIN_NUM;
        cfg.gpioFun=USB_DN_PIN_FUNC;
        GLB_GPIO_Init(&cfg);
#endif
        
#ifdef USE_INTERNAL_TRANSCEIVER
        cfg.gpioPin=USB_DP_PIN_NUM;
        cfg.gpioFun=USB_DP_PIN_FUNC;
        GLB_GPIO_Init(&cfg);
        GLB_GPIO_INPUT_Disable(cfg.gpioPin);
        cfg.gpioPin=USB_DN_PIN_NUM;
        cfg.gpioFun=USB_DN_PIN_FUNC;
        GLB_GPIO_Init(&cfg);
        GLB_GPIO_INPUT_Disable(cfg.gpioPin);
#endif
    }
}
void USB_HAL_Clock_Init(BL_Fun_Type NewState)
{
    if(NewState!=DISABLE){
        GLB_Set_USB_CLK(ENABLE);
    }else{
        GLB_Set_USB_CLK(DISABLE);
    }
}
void USB_HAL_Interrupts_Init(BL_Fun_Type NewState)
{
    bl_irq_register(USB_IRQn,USB_IRQHandler);
    if(NewState!=DISABLE){
        bl_irq_enable(USB_IRQn);
    }else{
        bl_irq_disable(USB_IRQn);
    }
}
void USB_HAL_System_Init(BL_Fun_Type NewState)
{
    USB_HAL_GPIO_Init(NewState);
    USB_HAL_Clock_Init(NewState);
    USB_HAL_Interrupts_Init(NewState);
}
void USB_HAL_Interrupts_LPM_Init(BL_Fun_Type NewState)
{
    /* enable/disable LPM interrupt */
    if(NewState!=DISABLE){
        USB_IntMask(USB_INT_LPM_WAKEUP,UNMASK);
        USB_IntMask(USB_INT_LPM_PACKET,UNMASK);
    }else{
        USB_IntMask(USB_INT_LPM_WAKEUP,MASK);
        USB_IntMask(USB_INT_LPM_PACKET,MASK);
    }
}

